BAS BMEKZU Project/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяУслуга</name>
    <comment>Является ли услуга транспортной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмеряетсяТолькоВСуммовомВыражении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаНДС</name>
    <comment>Льгота по НДС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкСтрогогоУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитываетсяПоНоминальнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСпецификацияНоменклатуры</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураГТД</name>
    <type>
      <types>CatalogRef.НоменклатураГТД</types>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоАкцизномуНалогу</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ВидПродукции</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыСХПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_УчитыватьВВедомостиДвижения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_Удобрение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_УдобрениеПроцент</name>
    <comment>Процент действующего вещества для удобрения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕдиницыИзмерения</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/InformationRegisters/СчетаУчетаНоменклатуры/СчетаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаУчетаНоменклатуры</name>
  <resources>
    <name>СчетУчетаБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПередачиБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаЗабалансовыйБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПередачиЗабалансовыйБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СхемаРеализации</name>
    <type>
      <types>CatalogRef.СхемыРеализации</types>
    </type>
  </resources>
  <resources>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>НалоговоеНазначениеДоходовИЗатрат</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоБУ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоБУ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоБУ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьТипСклада</name>
    <type>
      <types>EnumRef.УдалитьТипыСкладов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ТипыСкладов/ТипыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСкладов</name>
  <enumValues>
    <name>ОптовыйСклад</name>
    <comment>Оптовый склад</comment>
  </enumValues>
  <enumValues>
    <name>РозничныйМагазин</name>
    <comment>Розничный</comment>
  </enumValues>
  <enumValues>
    <name>НеавтоматизированнаяТорговаяТочка</name>
    <comment>Неавтоматизированная торговая точка</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/Номенклатура/Forms/ФормаСчетовУчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗаполнитьТаблицуСчетов()
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТаблицуСчетовУчета(Номенклатура,СчетаУчетаСкрытьНеИспользуемые)

	МассивНоменклатура	 = Новый Массив();
	МассивНоменклатура.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	МассивНоменклатура.Добавить(Номенклатура);

	СписокГрупп = ОбщегоНазначенияБПВызовСервера.ПолучитьСписокВышеСтоящихГрупп(Номенклатура);
	Для каждого Элемент Из СписокГрупп Цикл
	    МассивНоменклатура.Добавить(Элемент);
	КонецЦикла;

	ТестЗапрос = Новый Запрос();

	ТестЗапрос.УстановитьПараметр("Номенклатура",       МассивНоменклатура);
	ТестЗапрос.УстановитьПараметр("ПустаяОрганизания",  Справочники.Организации.ПустаяСсылка());
	ТестЗапрос.УстановитьПараметр("ПустойСклад",        Справочники.Склады.ПустаяСсылка());
	ТестЗапрос.УстановитьПараметр("ПустойТипСклада",    Перечисления.ТипыСкладов.ПустаяСсылка());

	ТестЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ВЫБОР
	|       КОГДА СчетаУчетаНоменклатуры.Организация = &ПустаяОрганизания
	|           ТОГДА " + НСтр("ru='""< Для всех >""';uk='""< Для всіх >""'") + "
	|       ИНАЧЕ СчетаУчетаНоменклатуры.Организация
	|   КОНЕЦ КАК Организация,
	|   СчетаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|   СчетаУчетаНоменклатуры.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|   ВЫБОР
	|       КОГДА СчетаУчетаНоменклатуры.Склад = &ПустойСклад
	|           ТОГДА " + НСтр("ru='""< Для всех >""';uk='""< Для всіх >""'") + "
	|       ИНАЧЕ СчетаУчетаНоменклатуры.Склад
	|   КОНЕЦ КАК Склад,
	|   ВЫБОР
	|       КОГДА СчетаУчетаНоменклатуры.ТипСклада = &ПустойТипСклада
	|           ТОГДА " + НСтр("ru='""< Для всех >""';uk='""< Для всіх >""'") + "
	|       ИНАЧЕ СчетаУчетаНоменклатуры.ТипСклада
	|   КОНЕЦ КАК ТипСклада,
	|   СчетаУчетаНоменклатуры.СчетУчетаБУ КАК СчетУчета,
	|   СчетаУчетаНоменклатуры.СчетУчетаПередачиБУ КАК СчетУчетаПередачи,
	|   СчетаУчетаНоменклатуры.СубконтоБУ1 КАК Субконто1,
	|   СчетаУчетаНоменклатуры.СубконтоБУ2 КАК Субконто2,
	|   СчетаУчетаНоменклатуры.СубконтоБУ3 КАК Субконто3
	|ИЗ
	|   РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
	|ГДЕ
	|   СчетаУчетаНоменклатуры.Номенклатура В(&Номенклатура)";

	ТаблицаЗапроса = ТестЗапрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Колонки.Добавить("Глубина");
	ТаблицаЗапроса.Колонки.Добавить("Описание");
	ТаблицаЗапроса.Колонки.Добавить("Приоритет");
	ТаблицаЗапроса.Колонки.Добавить("АктивностьПравила");
	ТаблицаЗапроса.Колонки.Добавить("Общее");

	Для Каждого Строка Из ТаблицаЗапроса Цикл
		Описание = "";
		Если Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Строка.Глубина = 0;
			Описание = НСтр("ru='Для всех номенклатурных единиц (при отсутствии других правил)';uk='Для всіх номенклатурних одиниць (при відсутності інших правил)'");
		ИначеЕсли Строка.Номенклатура = Номенклатура Тогда
			Строка.Глубина = СтрДлина(Строка.Номенклатура.ПолныйКод());
			Описание = НСтр("ru='Для номенклатурной единицы ';uk='Для номенклатурної одиниці '") + Строка(Строка.Номенклатура);
		Иначе
			Строка.Глубина = СтрДлина(Строка.Номенклатура.ПолныйКод());
			Описание = НСтр("ru='Для всех номенклатурных единиц, входящих в группу ';uk='Для всіх номенклатурних одиниць, що входять в групу '") + Строка(Строка.Номенклатура);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Организация) Тогда
			Описание = Описание + НСтр("ru='; по организации ';uk='; по організації '") + Строка(Строка.Организация);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Склад) Тогда
			Описание = Описание + НСтр("ru='; на складе ';uk='; на складі '") + Строка(Строка.Склад);
		ИначеЕсли ЗначениеЗаполнено(Строка.ТипСклада) Тогда
			Описание = Описание + НСтр("; на складах типа ';uk='; на складах типу '") + Строка(Строка.ТипСклада);
		КонецЕсли;

		Строка.Общее = ?(Строка.Номенклатура = Номенклатура, 1, 0);
		Строка.Описание = Описание;
	КонецЦикла;

	ТаблицаЗапроса.Сортировать("Глубина Убыв, Склад Убыв, ТипСклада Убыв, Организация Убыв", Новый СравнениеЗначений);

	Если ТаблицаЗапроса.Количество() > 0 Тогда

		АктивностьОпт = Истина;
		АктивностьРозница = Истина;

		ТекПриоритет = 1;
		ТекКлючПриоритета = (ТаблицаЗапроса[0].Глубина*1000) + (Число(ЗначениеЗаполнено(ТаблицаЗапроса[0].Организация))*100) 
		+ (Число(ЗначениеЗаполнено(ТаблицаЗапроса[0].Склад))*10) + (Число(ЗначениеЗаполнено(ТаблицаЗапроса[0].ТипСклада)));

		Для Каждого Строка Из ТаблицаЗапроса Цикл
			КлючПриоритета = (Строка.Глубина*1000) + (Число(ЗначениеЗаполнено(Строка.Организация))*100) 
			+ (Число(ЗначениеЗаполнено(Строка.Склад))*10) + (Число(ЗначениеЗаполнено(Строка.ТипСклада)));

			Если КлючПриоритета <> ТекКлючПриоритета Тогда
				ТекКлючПриоритета = КлючПриоритета;
				ТекПриоритет = ТекПриоритет + 1;
			КонецЕсли;
			Строка.Приоритет = ТекПриоритет;

			Если Строка.ТипСклада = НСтр("ru='< Для всех >';uk='< Для всіх >'") Тогда
				Строка.АктивностьПравила = (АктивностьОпт ИЛИ АктивностьРозница);
			ИначеЕсли Строка.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
				Строка.АктивностьПравила = (АктивностьОпт);
			Иначе
				Строка.АктивностьПравила = (АктивностьРозница);
			КонецЕсли;

			Если Строка.Организация = НСтр("ru='< Для всех >';uk='< Для всіх >'") И Строка.Склад = НСтр("ru='< Для всех >';uk='< Для всіх >'") Тогда
				Если НЕ ЗначениеЗаполнено(Строка.ТипСклада) Тогда
					АктивностьОпт = Ложь;
					АктивностьРозница = Ложь;
				ИначеЕсли Строка.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
					АктивностьОпт = Ложь;
				Иначе
					АктивностьРозница = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Если СчетаУчетаСкрытьНеИспользуемые Тогда
			НайденныеСтроки = ТаблицаЗапроса.НайтиСтроки(Новый Структура("АктивностьПравила", Ложь));
			Для Каждого Строка Из НайденныеСтроки Цикл
				ТаблицаЗапроса.Удалить(Строка);
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;

	Возврат ТаблицаЗапроса;

КонецФункции


&НаКлиенте
Процедура ОбновитьСчетаУчета(Команда)
    
    ЗаполнитьТаблицуСчетов();
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьТаблицуСчетов()
    
    Результат = СформироватьТаблицуСчетовУчета(Параметры.НоменклатураСчетов,Элементы.КнопкаСчетаУчетаСкрытьНеИспользуемые.Пометка); 
    ЗначениеВРеквизитФормы(Результат,"СчетаУчета");
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаСкрытьНеИспользуемые(Команда)
    Элементы.КнопкаСчетаУчетаСкрытьНеИспользуемые.Пометка = НЕ Элементы.КнопкаСчетаУчетаСкрытьНеИспользуемые.Пометка;
    ЗаполнитьТаблицуСчетов();
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаСправкаРегистра(Команда)
    ОткрытьСправку("РегистрСведений.СчетаУчетаНоменклатуры");
КонецПроцедуры
